---
kind: property
id: P:Autodesk.Revit.DB.Structure.AreaReinforcement.AreaReinforcementType
source: html/c653d882-ddde-c6bf-806d-add2df555275.htm
---
# Autodesk.Revit.DB.Structure.AreaReinforcement.AreaReinforcementType Property

Retrieves the type of the Area Reinforcement.

## Syntax (C#)
```csharp
public AreaReinforcementType AreaReinforcementType { get; }
```